/*Реализовать пакет подпрограмм для работы с бинарным деревом поиска (АВЛ), ключ в котором представлен в виде структуры (ФИО + время) (типы полей ключа должны соответствовать типу данных в предметной области - все что является числом, должно храниться в виде числа, а не строки, например, время - это не строка, а структура из двух полей целочисленного типа).
   Основные операции:
   [?] 1. Инициализация (пустого дерева)
   [?] 2. Добавление нового элемента
   [] 3. Удаление заданного элемента (минимальный справа) (при полном совпадении ключа и номера строки)
   [?] 4. Поиск заданного элемента
   [] 5. Печать
   [] 6. Обход: слева направо
   [] 7. Освобождение памяти (удаление всего дерева)
   [] 8. (доп. операция - вариант выдается при сдаче задания)
   Входные данные: текстовый файл, каждая из строк которого содержит данные заданной предметной области (ФИО + время).
   Выходные данные: текстовый файл, строки которого содержат данные входного файла в порядке заданного обхода дерева поиска.
   [] 1. Загрузить данные из текстового файла в дерево поиска. При загрузке вызывать процедуру добавления с проверкой ключа на корректность. Список номеров строк входного файла, содержащих заданный ключ, хранить в цепочке (списке) задания 1.1.
   [] 2. Вызвать подпрограммы работы с деревом.
   [] 3. Сохранить итоговое дерево в текстовый файл в порядке заданного обхода.
 */



using AVL_tree;

public class Program
{
    
    public static void Main(string[] args)
    {
        Console.WriteLine("hui");
    }
}